; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem BW-rand-8)
(:domain blocksworld)
(:objects b1 b2 b3 b4 b5 b6 b7 b8 )
(:init
(arm-empty)
(on-table b1)
(on b2 b4)
(on b3 b6)
(on-table b4)
(on b5 b1)
(on b6 b8)
(on b7 b3)
(on b8 b5)
(clear b2)
(clear b7)
)
(:goal
(and
(on b2 b4)
(on b5 b3)
(on b6 b8)
(on b7 b2))
)
)

; plan
1. (unstack b7 b3)
   deleted: (on b7 b3) (clear b7) (arm-empty)
   added: (holding b7) (clear b3)
   goals met: 2 of 4
2. (stack b7 b2)
   deleted: (clear b2) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b2)
   goals met: 3 of 4
3. (unstack b3 b6)
   deleted: (on b3 b6) (clear b3) (arm-empty)
   added: (holding b3) (clear b6)
   goals met: 3 of 4
4. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 3 of 4
5. (unstack b6 b8)
   deleted: (on b6 b8) (clear b6) (arm-empty)
   added: (holding b6) (clear b8)
   goals met: 2 of 4
6. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 2 of 4
7. (unstack b8 b5)
   deleted: (on b8 b5) (clear b8) (arm-empty)
   added: (holding b8) (clear b5)
   goals met: 2 of 4
8. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 2 of 4
9. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 2 of 4
10. (stack b6 b8)
   deleted: (clear b8) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b8)
   goals met: 3 of 4
11. (unstack b5 b1)
   deleted: (on b5 b1) (clear b5) (arm-empty)
   added: (holding b5) (clear b1)
   goals met: 3 of 4
12. (stack b5 b3)
   deleted: (clear b3) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b3)
   goals met: 4 of 4
